Sravan1993/Contiki-lpc1347/cpu/arm/lpc1347/timer16.c
/**************************************************************************/
/*!
    @file     timer16.c
    @author   K. Townsend (microBuilder.eu)

    @section LICENSE

    Software License Agreement (BSD License)

    Copyright (c) 2013, K. Townsend (microBuilder.eu)
    All rights reserved.

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
    1. Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holders nor the
    names of its contributors may be used to endorse or promote products
    derived from this software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ''AS IS'' AND ANY
    EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY
    DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
    (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
    ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
    SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
/**************************************************************************/
#include "LPC13Uxx.h"
#include "timer16.h"
#include "nmi.h"

volatile uint32_t timer16_0_counter[4] = {0,0,0,0};
volatile uint32_t timer16_1_counter[4] = {0,0,0,0};
volatile uint32_t timer16_0_capture[4] = {0,0,0,0};
volatile uint32_t timer16_1_capture[4] = {0,0,0,0};
volatile uint32_t timer16_0_period = 0;
volatile uint32_t timer16_1_period = 0;

// NOTE: 16-bit Timer 0 is used by src/core/delay/delay.c
// NOTE: 16-bit Timer 1 is used by src/drivers/sensors/sensorpoll.c

///**************************************************************************/
///*!
//    @brief Interrupt handler for 16-bit timer 0
//*/
///**************************************************************************/
//#if defined CFG_MCU_FAMILY_LPC11UXX
//void TIMER16_0_IRQHandler(void)
//#elif defined CFG_MCU_FAMILY_LPC13UXX
//void CT16B0_IRQHandler(void)
//#else
//  #error "timer16.c: No MCU defined"
//#endif
//{
//  /* Handle match events */
//  if (LPC_CT16B0->IR & (0x01 << 0))
//  {
//    LPC_CT16B0->IR = 0x1 << 0;
//    timer16_0_counter[0]++;
//  }
//  if (LPC_CT16B0->IR & (0x01 << 1))
//  {
//    LPC_CT16B0->IR = 0x1 << 1;
//    timer16_0_counter[1]++;
//  }
//  if (LPC_CT16B0->IR & (0x01 << 2))
//  {
//    LPC_CT16B0->IR = 0x1 << 2;
//    timer16_0_counter[2]++;
//  }
//  if (LPC_CT16B0->IR & (0x01 << 3))
//  {
//    LPC_CT16B0->IR = 0x1 << 3;
//    timer16_0_counter[3]++;
//  }
//
//  /* Handle capture events */
//  if (LPC_CT16B0->IR & (0x1 << 4))
//  {
//    LPC_CT16B0->IR = 0x1 << 4;
//    timer16_0_capture[0]++;
//  }
//  if (LPC_CT16B0->IR & (0x1 << 5))
//  {
//    LPC_CT16B0->IR = 0x1 << 5;
//    timer16_0_capture[1]++;
//  }
//  if (LPC_CT16B0->IR & (0x1 << 6))
//  {
//    LPC_CT16B0->IR = 0x1 << 6;
//    timer16_0_capture[2]++;
//  }
//  if (LPC_CT16B0->IR & (0x1 << 7))
//  {
//    LPC_CT16B0->IR = 0x1 << 7;
//    timer16_0_capture[3]++;
//  }
//
//  return;
//}

///**************************************************************************/
///*!
//    @brief Interrupt handler for 16-bit timer 1
//*/
///**************************************************************************/
//#if defined CFG_MCU_FAMILY_LPC11UXX
//void TIMER16_1_IRQHandler(void)
//#elif defined CFG_MCU_FAMILY_LPC13UXX
//void CT16B1_IRQHandler(void)
//#else
//  #error "timer16.c: No MCU defined"
//#endif
//{
//  /* Handle match events */
//  if (LPC_CT16B1->IR & (0x01 << 0))
//  {
//    LPC_CT16B1->IR = 0x1 << 0;
//    timer16_1_counter[0]++;
//  }
//  if (LPC_CT16B1->IR & (0x01 << 1))
//  {
//    LPC_CT16B1->IR = 0x1 << 1;
//    timer16_1_counter[1]++;
//  }
//  if (LPC_CT16B1->IR & (0x01 << 2))
//  {
//    LPC_CT16B1->IR = 0x1 << 2;
//    timer16_1_counter[2]++;
//  }
//  if (LPC_CT16B1->IR & (0x01 << 3))
//  {
//    LPC_CT16B1->IR = 0x1 << 3;
//    timer16_1_counter[3]++;
//  }
//
//  /* Handle capture events */
//  if (LPC_CT16B1->IR & (0x1 << 4))
//  {
//    LPC_CT16B1->IR = 0x1 << 4;
//    timer16_1_capture[0]++;
//  }
//  if (LPC_CT16B1->IR & (0x1 << 5))
//  {
//    LPC_CT16B1->IR = 0x1 << 5;
//    timer16_1_capture[1]++;
//  }
//  if (LPC_CT16B1->IR & (0x1 << 6))
//  {
//    LPC_CT16B1->IR = 0x1 << 6;
//    timer16_1_capture[2]++;
//  }
//  if (LPC_CT16B1->IR & (0x1 << 7))
//  {
//    LPC_CT16B1->IR = 0x1 << 7;
//    timer16_1_capture[3]++;
//  }
//
//  return;
//}

/**************************************************************************/
/*!
    @brief Initialises the specified 16-bit timer

    @param[in]  timer
                The 16-bit timer to use (must be 0 or 1)
*/
/**************************************************************************/
/*
void timer16Init(uint8_t timer)
{
  uint32_t i;

  if ( timer == 0 )
  {
    LPC_SYSCON->SYSAHBCLKCTRL |= (1 << 7);
    for ( i = 0; i < 4; i++ )
    {
      timer16_0_counter[i] = 0;
      timer16_0_capture[i] = 0;
    }
    #if defined CFG_MCU_FAMILY_LPC11UXX
    NVIC_EnableIRQ(TIMER_16_0_IRQn);
    #elif defined CFG_MCU_FAMILY_LPC13UXX
    NVIC_EnableIRQ(CT16B0_IRQn);
    #endif
  }
  else if ( timer == 1 )
  {
    LPC_SYSCON->SYSAHBCLKCTRL |= (1 << 8);
    for ( i = 0; i < 4; i++ )
    {
      timer16_1_counter[i] = 0;
      timer16_1_capture[i] = 0;
    }
    #if defined CFG_MCU_FAMILY_LPC11UXX
    NVIC_EnableIRQ(TIMER_16_1_IRQn);
    #elif defined CFG_MCU_FAMILY_LPC13UXX
    NVIC_EnableIRQ(CT16B1_IRQn);
    #endif
  }

  return;
}

************************************************************************
!
    @brief Enables the specified 16-bit timer

