Sravan1993/Contiki-lpc1347/cpu/arm/lpc1347/timer16.c
    @param[in]  timer
                The 16-bit timer to use (must be 0 or 1)

************************************************************************
void timer16Enable(uint8_t timer)
{
  if ( timer == 0 )
  {
    LPC_CT16B0->TCR = 1;
  }
  else if (timer == 1)
  {
    LPC_CT16B1->TCR = 1;
  }
  return;
}

************************************************************************
!
    @brief Disables the specified 16-bit timer

    @param[in]  timer
                The 16-bit timer to use (must be 0 or 1)

************************************************************************
void timer16Disable(uint8_t timer)
{
  if ( timer == 0 )
  {
    LPC_CT16B0->TCR = 0;
  }
  else if (timer == 1)
  {
    LPC_CT16B1->TCR = 0;
  }
  return;
}

************************************************************************
!
    @brief Resets the specified 16-bit timer

    @param[in]  timer
                The 16-bit timer to use (must be 0 or 1)

************************************************************************
void timer16Reset(uint8_t timer)
{
  uint32_t regVal;

  if ( timer == 0 )
  {
    regVal = LPC_CT16B0->TCR;
    regVal |= 0x02;
    LPC_CT16B0->TCR = regVal;
  }
  else if (timer == 1)
  {
    regVal = LPC_CT16B1->TCR;
    regVal |= 0x02;
    LPC_CT16B1->TCR = regVal;
  }
  return;
}

************************************************************************
!
    @brief Causes a blocking delay on the specified 16-bit timer

    @param[in]  timer
                The 16-bit timer to use (must be 0 or 1)
    @param[in]  delayInTicks
                The number of clock cycles ('ticks') to wait

************************************************************************
void timer16DelayTicks(uint8_t timer, uint16_t delayInTicks)
{
  if (timer == 0)
  {
    LPC_CT16B0->TCR  = 0x02;             Reset the timer
    LPC_CT16B0->PR   = 0x00;             Set prescaler to zero
    LPC_CT16B0->PWMC = 0x00;             Disable PWM mode
    LPC_CT16B0->MR0  = delayInTicks;
    LPC_CT16B0->IR   = 0xff;             Reset all interrrupts
    LPC_CT16B0->MCR  = 0x04;             Stop the timer on match
    LPC_CT16B0->TCR  = 0x01;             Start timer

     Wait until delay time has elapsed
    while (LPC_CT16B0->TCR & 0x01);
  }
  else if (timer == 1)
  {
    LPC_CT16B1->TCR  = 0x02;             Reset the timer
    LPC_CT16B1->PR   = 0x00;             Set prescaler to zero
    LPC_CT16B1->PWMC = 0x00;             Disable PWM mode
    LPC_CT16B1->MR0  = delayInTicks;
    LPC_CT16B1->IR   = 0xff;             Reset all interrrupts
    LPC_CT16B1->MCR  = 0x04;             Stop the timer on match
    LPC_CT16B1->TCR  = 0x01;             Start timer

     Wait until delay time has elapsed
    while (LPC_CT16B1->TCR & 0x01);
  }
  return;
}

************************************************************************
!
    @brief Configures the match register for the specified 16-bit timer

    @param[in]  timer
                The 16-bit timer to use (must be 0 or 1)
    @param[in]  matchNum
                The match register to set (must be 0..3)
    @param[in]  value
                The value to assign to the specified match register

    @code
    // Set MAT1 on timer 0 to 12000 ticks
    timer16SetMatch(0, 1, 12000);
    @endcode

************************************************************************
void timer16SetMatch(uint8_t timer, uint8_t matchNum, uint16_t value)
{
  if (timer)
  {
    switch (matchNum)
    {
      case 0:
        LPC_CT16B1->MR0 = value;
        break;
      case 1:
        LPC_CT16B1->MR1 = value;
        break;
      case 2:
        LPC_CT16B1->MR2 = value;
        break;
      case 3:
        LPC_CT16B1->MR3 = value;
        break;
      default:
        break;
    }
  }
  else
  {
    switch (matchNum)
    {
      case 0:
        LPC_CT16B0->MR0 = value;
        break;
      case 1:
        LPC_CT16B0->MR1 = value;
        break;
      case 2:
        LPC_CT16B0->MR2 = value;
        break;
      case 3:
        LPC_CT16B0->MR3 = value;
        break;
      default:
        break;
    }
  }
}

************************************************************************
!
    @brief  Configures 16-bit Timer 1 for PWM output using MR0 to control
            the period, and MR1, MR2 and MR3 for duty cycle.  Duty cycle
            can be adjusted via timer16SetMatch.

    @param[in]  period
                The period in timer clock ticks

    @code
    // Setup PWM with 12,000 cycle period (MAT0 used for period)
    timer16SetPWM1(12000);

    // PWM Match Settings
    timer16SetMatch(1, 1, 12000); // MAT1 will go high on last cycle
    timer16SetMatch(1, 2, 8000);  // MAT2 will go high for final 1/3
    timer16SetMatch(1, 3, 4000);  // MAT3 will go high for final 2/3

    // Enable to PWM output
    timer16Enable(1);
    @endcode

************************************************************************
void timer16SetPWM1(uint16_t period)
{
  timer16Disable(1);

   Make sure 16-bit timer 1 is enabled
  LPC_SYSCON->SYSAHBCLKCTRL |= (1<<8);

   Setup the external match register (clear on match)
  LPC_CT16B1->EMR =  (1<<10) | (1<<8) | (1<<6) | (1<<4) |
                     (1<<0)  | (1<<1) | (1<<2) | (1<<3);

   Set MAT0..3 to PWM mode via the PWM Control register
  LPC_CT16B1->PWMC = (1<<0)  | (1<<1) | (1<<2) | (1<<3);

   MAT0 controls period, set MAT1..3 to 50% duty cycle to start
  timer16SetMatch(1, 0, period);
  timer16SetMatch(1, 1, period / 2);
  timer16SetMatch(1, 2, period / 2);
  timer16SetMatch(1, 3, period / 2);

   Reset on MR0
  LPC_CT16B1->MCR = 1 << 1;
}
*/
void delayMs(uint8_t timer_num, uint32_t delayInMs)
{
  if (timer_num == 0)
  {
    /*
    * setup timer #0 for delay
    */
    LPC_CT16B0->TCR = 0x02;		/* reset timer */
    LPC_CT16B0->PR  = 0x00;		/* set prescaler to zero */
    LPC_CT16B0->MR0 = delayInMs * (SystemCoreClock / 1000);
    LPC_CT16B0->IR  = 0xff;		/* reset all interrrupts */
    LPC_CT16B0->MCR = 0x04;		/* stop timer on match */
    LPC_CT16B0->TCR = 0x01;		/* start timer */
    /* wait until delay time has elapsed */
    while (LPC_CT16B0->TCR & 0x01);
  }
  else if (timer_num == 1)
  {
    /*
    * setup timer #1 for delay
    */
    LPC_CT16B1->TCR = 0x02;		/* reset timer */
    LPC_CT16B1->PR  = 0x00;		/* set prescaler to zero */
    LPC_CT16B1->MR0 = delayInMs * (SystemCoreClock / 1000);
    LPC_CT16B1->IR  = 0xff;		/* reset all interrrupts */
    LPC_CT16B1->MCR = 0x04;		/* stop timer on match */
    LPC_CT16B1->TCR = 0x01;		/* start timer */
    /* wait until delay time has elapsed */
    while (LPC_CT16B1->TCR & 0x01);
  }
  return;
}

