Sravan1993/Contiki-lpc1347/cpu/arm/lpc1347/timer16.c
/******************************************************************************
** Function name:		CT16B0_IRQHandler
**
** Descriptions:		Timer/CounterX and CaptureX interrupt handler
**
** parameters:			None
** Returned value:		None
**
******************************************************************************/
void CT16B0_IRQHandler(void)
{
  if ( LPC_CT16B0->IR & (0x1<<0) )
  {
	LPC_CT16B0->IR = 0x1<<0;			/* clear interrupt flag */
	timer16_0_counter[0]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<1) )
  {
	LPC_CT16B0->IR = 0x1<<1;			/* clear interrupt flag */
	timer16_0_counter[1]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<2) )
  {
	LPC_CT16B0->IR = 0x1<<2;			/* clear interrupt flag */
	timer16_0_counter[2]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<3) )
  {
	LPC_CT16B0->IR = 0x1<<3;			/* clear interrupt flag */
	timer16_0_counter[3]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<4) )
  {
	LPC_CT16B0->IR = 0x1<<4;		/* clear interrupt flag */
	timer16_0_capture[0]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<5) )
  {
	LPC_CT16B0->IR = 0x1<<5;		/* clear interrupt flag */
	timer16_0_capture[1]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<6) )
  {
	LPC_CT16B0->IR = 0x1<<6;		/* clear interrupt flag */
	timer16_0_capture[2]++;
  }
  if ( LPC_CT16B0->IR & (0x1<<7) )
  {
	LPC_CT16B0->IR = 0x1<<7;		/* clear interrupt flag */
	timer16_0_capture[3]++;
  }
  return;
}

/******************************************************************************
** Function name:		CT16B1_IRQHandler
**
** Descriptions:		Timer/CounterX and CaptureX interrupt handler
**
** parameters:			None
** Returned value:		None
**
******************************************************************************/
void CT16B1_IRQHandler(void)
{
  if ( LPC_CT16B1->IR & (0x1<<0) )
  {
	LPC_CT16B1->IR = 0x1<<0;			/* clear interrupt flag */
	timer16_1_counter[0]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<1) )
  {
	LPC_CT16B1->IR = 0x1<<1;			/* clear interrupt flag */
	timer16_1_counter[1]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<2) )
  {
	LPC_CT16B1->IR = 0x1<<2;			/* clear interrupt flag */
	timer16_1_counter[2]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<3) )
  {
	LPC_CT16B1->IR = 0x1<<3;			/* clear interrupt flag */
	timer16_1_counter[3]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<4) )
  {
	LPC_CT16B1->IR = 0x1<<4;		/* clear interrupt flag */
	timer16_1_capture[0]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<5) )
  {
	LPC_CT16B1->IR = 0x1<<5;		/* clear interrupt flag */
	timer16_1_capture[1]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<6) )
  {
	LPC_CT16B1->IR = 0x1<<6;		/* clear interrupt flag */
	timer16_1_capture[2]++;
  }
  if ( LPC_CT16B1->IR & (0x1<<7) )
  {
	LPC_CT16B1->IR = 0x1<<7;		/* clear interrupt flag */
	timer16_1_capture[3]++;
  }
  return;
}

/******************************************************************************
** Function name:		enable_timer
**
** Descriptions:		Enable timer
**
** parameters:			timer number: 0 or 1
** Returned value:		None
**
******************************************************************************/
void enable_timer16(uint8_t timer_num)
{
  if ( timer_num == 0 )
  {
    LPC_CT16B0->TCR = 1;
  }
  else
  {
    LPC_CT16B1->TCR = 1;
  }
  return;
}

/******************************************************************************
** Function name:		disable_timer
**
** Descriptions:		Disable timer
**
** parameters:			timer number: 0 or 1
** Returned value:		None
**
******************************************************************************/
void disable_timer16(uint8_t timer_num)
{
  if ( timer_num == 0 )
  {
    LPC_CT16B0->TCR = 0;
  }
  else
  {
    LPC_CT16B1->TCR = 0;
  }
  return;
}

/******************************************************************************
** Function name:		reset_timer
**
** Descriptions:		Reset timer
**
** parameters:			timer number: 0 or 1
** Returned value:		None
**
******************************************************************************/
void reset_timer16(uint8_t timer_num)
{
  uint32_t regVal;

  if ( timer_num == 0 )
  {
    regVal = LPC_CT16B0->TCR;
    regVal |= 0x02;
    LPC_CT16B0->TCR = regVal;
  }
  else
  {
    regVal = LPC_CT16B1->TCR;
    regVal |= 0x02;
    LPC_CT16B1->TCR = regVal;
  }
  return;
}

/******************************************************************************
** Function name:		Set_timer_capture
**
** Descriptions:		set timer capture based on LOC number.
**
** parameters:			timer number and location number
** Returned value:		None
**
******************************************************************************/
void set_timer16_capture(uint8_t timer_num, uint8_t location )
{
  if ( timer_num == 0 )
  {
	/*  Timer0_16 I/O config */
	if ( location == 0 )
	{
	  LPC_IOCON->PIO1_16           &= ~0x07;
	  LPC_IOCON->PIO1_16           |= 0x02;		/* Timer0_16 CAP0 */
	  LPC_IOCON->PIO1_17           &= ~0x07;
	  LPC_IOCON->PIO1_17           |= 0x01;		/* Timer0_16 CAP2 */
	}
	else if ( location == 1 )
	{
	  LPC_IOCON->PIO0_2            &= ~0x07;
	  LPC_IOCON->PIO0_2            |= 0x02;		/* Timer0_16 CAP0 */
	}
	else
	{
	  while ( 1 );				/* Fatal location number error */
	}
  }
  else
  {
	/*  Timer1_16 I/O config */
	if ( location == 0 )
	{
	  LPC_IOCON->PIO0_20           &= ~0x07;	/*  Timer1_16 I/O config */
	  LPC_IOCON->PIO0_20           |= 0x01;		/* Timer1_16 CAP0 */
	  LPC_IOCON->PIO1_18           &= ~0x07;
	  LPC_IOCON->PIO1_18           |= 0x01;		/* Timer1_16 CAP1 */
	}
	else
	{
	  while ( 1 );				/* Fatal location number error */
	}
  }
  return;
}

/******************************************************************************
** Function name:		Set_timer_match
**
** Descriptions:		set timer match based on LOC number.
**
** parameters:			timer number, match enable, and location number
** Returned value:		None
**
******************************************************************************/
void set_timer16_match(uint8_t timer_num, uint8_t match_enable, uint8_t location)
{
  if ( timer_num == 0 )
  {
	if ( match_enable & 0x01 )
	{
	  /*  Timer0_16 I/O config */
	  if ( location == 0 )
	  {
		LPC_IOCON->PIO0_8           &= ~0x07;
		LPC_IOCON->PIO0_8           |= 0x02;		/* Timer0_16 MAT0 */
	  }
	  else if ( location == 1 )
	  {
		LPC_IOCON->PIO1_13           &= ~0x07;
		LPC_IOCON->PIO1_13           |= 0x02;		/* Timer0_16 MAT0 */
	  }
	}
	if ( match_enable & 0x02 )
	{
	  /*  Timer0_16 I/O config */
	  if ( location == 0 )
	  {
		LPC_IOCON->PIO0_9           &= ~0x07;
		LPC_IOCON->PIO0_9           |= 0x02;		/* Timer0_16 MAT1 */
	  }
	  else if ( location == 1 )
	  {
		LPC_IOCON->PIO1_14           &= ~0x07;
		LPC_IOCON->PIO1_14           |= 0x02;		/* Timer0_16 MAT1 */
	  }
	}
	if ( match_enable & 0x04 )
	{
	  /*  Timer0_16 I/O config */
	  if ( location == 0 )
	  {
#ifdef __SWD_DISABLED
		LPC_IOCON->SWCLK_PIO0_10    &= ~0x07;
		LPC_IOCON->SWCLK_PIO0_10    |= 0x03;		/* Timer0_16 MAT2 */
#endif
	  }
	  else if ( location == 1 )
	  {
		LPC_IOCON->PIO1_15           &= ~0x07;
		LPC_IOCON->PIO1_15           |= 0x02;		/* Timer0_16 MAT2 */
	  }
	}
  }
  else if ( timer_num == 1 )
  {
	if ( match_enable & 0x01 )
	{
	  /*  Timer1_16 I/O config */
	  if ( location == 0 )
	  {
		LPC_IOCON->PIO0_21           &= ~0x07;
		LPC_IOCON->PIO0_21           |= 0x01;		/* Timer1_16 MAT0 */
	  }
	}
	if ( match_enable & 0x02 )
	{
	  /*  Timer1_16 I/O config */
	  if ( location == 0 )
	  {
		LPC_IOCON->PIO0_22           &= ~0x07;
		LPC_IOCON->PIO0_22           |= 0x02;		/* Timer1_16 MAT1 */
	  }
	  else if ( location == 1 )
	  {
		LPC_IOCON->PIO1_23           &= ~0x07;
		LPC_IOCON->PIO1_23           |= 0x01;		/* Timer1_16 MAT1 */
	  }
	}
  }
  return;
}

