Sravan1993/Contiki-lpc1347/cpu/arm/lpc1347/timer16.c
/******************************************************************************
** Function name:		init_timer
**
** Descriptions:		Initialize timer, set timer interval, reset timer,
**						install timer interrupt handler
**
** parameters:			timer number and timer interval
** Returned value:		None
**
******************************************************************************/
void init_timer16(uint8_t timer_num, uint32_t TimerInterval)
{
  uint32_t i;

  if ( timer_num == 0 )
  {
    /* Some of the I/O pins need to be carefully planned if
    you use below module because JTAG and TIMER CAP/MAT pins are muxed. */
    LPC_SYSCON->SYSAHBCLKCTRL |= (1<<7);

    LPC_CT16B0->MR0 = TimerInterval;
    LPC_CT16B0->MR1 = TimerInterval;
#if TIMER_MATCH
    for ( i = 0; i < 4; i++ )
    {
      timer16_0_counter[i] = 0;
    }
    set_timer16_match(timer_num, 0x07, 0);
    LPC_CT16B0->EMR &= ~(0xFF<<4);
    LPC_CT16B0->EMR |= ((0x3<<4)|(0x3<<6)|(0x3<<8));
#else
    for ( i = 0; i < 4; i++ )
    {
      timer16_0_capture[i] = 0;
    }
    set_timer16_capture(timer_num, 0);
    /* Capture 0 and 2 on rising edge, interrupt enable. */
    LPC_CT16B0->CCR = (0x5<<0)|(0x5<<6);
#endif
    LPC_CT16B0->MCR = (0x3<<0)|(0x3<<3);  /* Interrupt and Reset on MR0 and MR1 */

    /* Enable the TIMER0 Interrupt */
#if NMI_ENABLED
    NVIC_DisableIRQ(CT16B0_IRQn);
    NMI_Init( CT16B0_IRQn );
#else
    NVIC_EnableIRQ(CT16B0_IRQn);
#endif
  }
  else if ( timer_num == 1 )
  {
    /* Some of the I/O pins need to be clearfully planned if
    you use below module because JTAG and TIMER CAP/MAT pins are muxed. */
    LPC_SYSCON->SYSAHBCLKCTRL |= (1<<8);
    LPC_CT16B1->MR0 = TimerInterval;
    LPC_CT16B1->MR1 = TimerInterval;
#if TIMER_MATCH
    for ( i = 0; i < 4; i++ )
    {
      timer16_1_counter[i] = 0;
    }
    set_timer16_match(timer_num, 0x07, 0);
    LPC_CT16B1->EMR &= ~(0xFF<<4);
    LPC_CT16B1->EMR |= ((0x3<<4)|(0x3<<6)|(0x3<<8));
#else
    for ( i = 0; i < 4; i++ )
    {
      timer16_1_capture[i] = 0;
    }
    set_timer16_capture(timer_num, 0);
    /* Capture 0 and 1 on rising edge, interrupt enable. */
    LPC_CT16B1->CCR = (0x5<<0)|(0x5<<3);
#endif
    LPC_CT16B1->MCR = (0x3<<0)|(0x3<<3);  /* Interrupt and Reset on MR0 and MR1 */

    /* Enable the TIMER1 Interrupt */
#if NMI_ENABLED
    NVIC_DisableIRQ(CT16B1_IRQn);
    NMI_Init( CT16B1_IRQn );
#else
    NVIC_EnableIRQ(CT16B1_IRQn);
#endif
  }
  return;
}

/******************************************************************************
** Function name:		init_timer16PWM
**
** Descriptions:		Initialize timer as PWM
**
** parameters:			timer number, period and match enable:
**						match_enable[0] = PWM for MAT0
**						match_enable[1] = PWM for MAT1
**						match_enable[2] = PWM for MAT2
**
** Returned value:	None
**
******************************************************************************/
void init_timer16PWM(uint8_t timer_num, uint32_t period, uint8_t match_enable, uint8_t cap_enabled)
{
  disable_timer16(timer_num);

  if (timer_num == 1)
  {
    /* Some of the I/O pins need to be clearfully planned if
    you use below module because JTAG and TIMER CAP/MAT pins are muxed. */
    LPC_SYSCON->SYSAHBCLKCTRL |= (1<<8);

    /* Setup the external match register */
    LPC_CT16B1->EMR = (1<<EMC3)|(1<<EMC2)|(1<<EMC1)|(2<<EMC0)|(1<<3)|(match_enable);

    /* Setup the outputs */
    /* If match0 is enabled, set the output */
    set_timer16_match(timer_num, match_enable, 0 );

    /* Enable the selected PWMs and enable Match3 */
    LPC_CT16B1->PWMC = (1<<3)|(match_enable);

    /* Setup the match registers */
    /* set the period value to a global variable */
    timer16_1_period 	= period;
    LPC_CT16B1->MR3 	= timer16_1_period;
    LPC_CT16B1->MR0	= timer16_1_period/2;
    LPC_CT16B1->MR1	= timer16_1_period/2;
    LPC_CT16B1->MR2	= timer16_1_period/2;

    /* Set match control register */
    LPC_CT16B1->MCR = 1<<10;// | 1<<9;				/* Reset on MR3 */

    if (cap_enabled)
    {
	  /* Use location 0 for test. */
	  set_timer16_capture( timer_num, 0 );
      LPC_CT16B1->IR = 0xF;							/* clear interrupt flag */

      /* Set the capture control register */
      LPC_CT16B1->CCR = 7;

    }
    /* Enable the TIMER1 Interrupt */
    NVIC_EnableIRQ(CT16B1_IRQn);
  }
  else
  {
    LPC_SYSCON->SYSAHBCLKCTRL |= (1<<7);

    /* Setup the external match register */
    LPC_CT16B0->EMR = (1<<EMC3)|(1<<EMC2)|(1<<EMC1)|(1<<EMC0)|(1<<3)|(match_enable);

    /* Setup the outputs */
    /* If match0 is enabled, set the output */
    set_timer16_match(timer_num, match_enable, 0 );

    /* Enable the selected PWMs and enable Match3 */
    LPC_CT16B0->PWMC = (1<<3)|(match_enable);

    /* Setup the match registers */
    /* set the period value to a global variable */
    timer16_0_period = period;
    LPC_CT16B0->MR3 = timer16_0_period;
    LPC_CT16B0->MR0 = timer16_0_period/2;
    LPC_CT16B0->MR1 = timer16_0_period/2;
    LPC_CT16B0->MR2 = timer16_0_period/2;

    /* Set the match control register */
    LPC_CT16B0->MCR = 1<<10;				/* Reset on MR3 */

    /* Enable the TIMER1 Interrupt */
    NVIC_EnableIRQ(CT16B0_IRQn);
  }
}

/******************************************************************************
** Function name:		pwm16_setMatch
**
** Descriptions:		Set the pwm16 match values
**
** parameters:			timer number, match numner and the value
**
** Returned value:		None
**
******************************************************************************/
void setMatch_timer16PWM (uint8_t timer_num, uint8_t match_nr, uint32_t value)
{
  if (timer_num)
  {
    switch (match_nr)
    {
      case 0:
        LPC_CT16B1->MR0 = value;
      break;
      case 1:
        LPC_CT16B1->MR1 = value;
      break;
      case 2:
        LPC_CT16B1->MR2 = value;
      break;
      case 3:
        LPC_CT16B1->MR3 = value;
      break;
      default:
        break;
    }
  }
  else
  {
    switch (match_nr)
    {
      case 0:
        LPC_CT16B0->MR0 = value;
      break;
      case 1:
        LPC_CT16B0->MR1 = value;
      break;
      case 2:
        LPC_CT16B0->MR2 = value;
      break;
      case 3:
        LPC_CT16B0->MR3 = value;
      break;
      default:
      break;
    }
  }
}

/******************************************************************************
**                            End Of File
******************************************************************************/
